Backend/loadtest/k6/results/baseline/guest/report-2026-07-22-005143.txt
     ✓ status is 201
     ✓ response has docId

     checks.........................: 100.00% ✓ 3520      ✗ 0   
     data_received..................: 672 kB  9.5 kB/s
     data_sent......................: 192 kB  2.7 kB/s
     http_req_blocked...............: avg=40.48µs  min=0s      med=0s      max=12.27ms  p(90)=0s       p(95)=0s     
     http_req_connecting............: avg=24.2µs   min=0s      med=0s      max=2.07ms   p(90)=0s       p(95)=0s     
     http_req_duration..............: avg=36.87ms  min=30.45ms med=35.53ms max=474.17ms p(90)=39.15ms  p(95)=41.84ms
       { expected_response:true }...: avg=36.87ms  min=30.45ms med=35.53ms max=474.17ms p(90)=39.15ms  p(95)=41.84ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 1760
     http_req_receiving.............: avg=278.89µs min=0s      med=0s      max=2.03ms   p(90)=918.58µs p(95)=995µs  
     http_req_sending...............: avg=15.68µs  min=0s      med=0s      max=3.27ms   p(90)=0s       p(95)=0s     
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=36.57ms  min=30.45ms med=35.24ms max=473.21ms p(90)=38.81ms  p(95)=41.34ms
     http_reqs......................: 1760    24.891966/s
     iteration_duration.............: avg=1.03s    min=1.03s   med=1.03s   max=1.47s    p(90)=1.03s    p(95)=1.04s  
     iterations.....................: 1760    24.891966/s
     vus............................: 3       min=1       max=50
     vus_max........................: 50      min=50      max=50